Revit 2027 API
ExternalResourceType Class
 A type class used to distinguish between different kinds of external resource.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.GuidEnum
 Autodesk.Revit.DB.ExternalResourceType
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExternalResourceType : GuidEnum
Public Class ExternalResourceType
	Inherits GuidEnum
public ref class ExternalResourceType : public GuidEnum
type ExternalResourceType =
    class
        inherit GuidEnum
    end
The ExternalResourceType type exposes the following members.
Constructors
Name | Description
ExternalResourceType | Creates a new ExternalResourceType instance.
Top
Properties
Name | Description
Guid |  The Guid of GUID-based enum object.
(Inherited from GuidEnum)
Top
Methods
Name | Description
Equals |  Compares two Guid-based enum object based on their concrete class and GUID value.
(Inherited from GuidEnum)
GetHashCode |  Generates a hash code for this Guid-based enum object.
(Inherited from GuidEnum)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Operators
Name | Description
Equality(ExternalResourceType, ExternalResourceType) | Compares two ExternalResourceType instances.
Inequality(ExternalResourceType, ExternalResourceType) | Compares two ExternalResourceType instances.
Top
Remarks
 Revit elements can consume multiple types of external resource data, provided by one or more external servers. Conversely, external servers can support one, or more than one, type of external resource.
See Also
Reference
Autodesk.Revit.DB Namespace